Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཅིའི་ཕྱིར་རིག་བྱེད་བཀླག་པའི་སླད་དུའོ།
en: “ ‘For the sake of what?’ “ ‘In order to learn the Vedas.’

source: །དེ་བཞིན་དུ་གྱིས་ཤིག །དེ་དེ་ལས་རིག་བྱེད་བཀླག་པར་བརྩམས་པ་ལས་དེ་ཡིད་གཞུངས་པའི་རང་བཞིན་ཅན་ཞིག་ཡིན་པས་དེས་རིང་པོ་མ་ལོན་པར་རིག་བྱེད་རྣམ་པ་བཞི་ལ་བྱང་བར་གྱུར་ཏོ།
en: “ ‘You should do so.’ “He began to learn the Vedas from him. Possessed of a brilliant nature, he soon mastered the four Vedas.

source: །བྲམ་ཟེ་དེས་བསམས་པ།
en: The brahmin thought, ‘I have made a vow:

source: བདག་གིས་དམ་བཅས་པ་ནི་བདག་གི་བུ་མོ་འདི་རིགས་སམ་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་ཏེ། བྲམ་ཟེའི་ཁྱེའུ་འདིས་བདག་ལས་རིག་བྱེད་བཞི་བྱང་བར་བྱས་པ་ཡིན་ན་མཚན་མ་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་སྟེ།
en: “I will not give this daughter of mine to anyone for his family . . . .” This young brahmin has mastered the four Vedas from me, but he has eighteen inauspicious marks.

source: གལ་ཏེ་འདིས་བུ་མོ་མ་འདོད་ན་ནི་ལེགས་སོ་སྙམ་ནས་དེས་དེ་ལ་སྨྲས་པ།
en: It would be good if he did not want my daughter.’ He said to Jujjuka, ‘Young brahmin, I have made a vow:

source: བྲམ་ཟེའི་ཁྱེའུ་བདག་གིས་བུ་མོ་འདི་བྱད་གཟུགས་སམ། རིགས་སམ། བཟོ་འམ། ནོར་གྱི་ཕྱིར་སུ་ལ་ཡང་མི་སྦྱིན་ཏེ།
en: “I will not give my daughter to anyone for his looks, family, work, or wealth.

source: འོན་ཀྱང་སུ་ཞིག་བདག་ལས་རིག་བྱེད་བཞི་ཀློག་པ་ཞིག་ཡོད་ན། བདག་གིས་དེ་ལ་འདི་སྦྱིན་པར་བྱའོ་ཞེས་དམ་བཅས་པ་ལས་བདག་ལས་ཁྱོད་ཀྱིས་རིག་བྱེད་བཞི་བྱང་བར་བྱས་པ་ལས་ཁྱོད་ལ་བུ་མོ་འདི་ཆུང་མར་སྦྱིན་ནོ། །དེས་སྨྲས་པ།
en: But if someone learns the four Vedas from me, I will give her to him.” Since you have mastered the four Vedas from me, I will give you this daughter as your wife.’

source: བཀྲ་ཤིས་པར་གྱུར་ཅིག །བླང་བར་བགྱིའོ་ཞེས་དེས་དེ་ལ་དཔལ་གྱི་འབྱོར་པ་ཆེན་པོས་བག་མར་བཏང་ནས་སྨྲས་པ།
en: “ ‘May all be well with you!’ he replied.

source: བྲམ་ཟེའི་ཁྱེའུ་ཆུང་མ་ཁྲིད་ལ་རང་གི་ཁྱིམ་དུ་སོང་ཤིག །དེས་ཆུང་མ་དེ་ཁྲིད་དེ་རང་གི་ཁྱིམ་དུ་སོང་བ་དང་། །དེས་དེ་ལ་སྨྲས་པ། རྗེའི་སྲས་བདག་ནི་ཤིན་ཏུ་གཞོན་པས་ལས་བགྱིད་རྔོ་མི་ཐོག་གིས་བདག་ལ་བཀོལ་བ་སྩོལ་ཅིག །དེས་དེ་ལ་སྨྲས་པ།
en: ‘I will accept her.’ “The brahmin gave her to him as a bride together with a vast amount of treasure and said, ‘Young brahmin, return to your home, taking your wife with you.’ “Taking his wife with him, he went to his home. She said to him, ‘My dear, I am so delicate that I cannot do housework. Please give me a servant.’

source: བཟང་མོ་ཁོ་བོ་ལ་བཀོལ་བ་ག་ལ་མཆིས། དེས་སྨྲས་པ།
en: “ ‘O good lady,’ he asked her, ‘where would I find a servant?’

source: རྗེའི་སྲས་ཐམས་ཅད་ཅེས་བགྱི་བའི་གྲོང་རྡལ་ན་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་ཞེས་བགྱི་བ་དེའི་སྲས་ཐམས་ཅད་སྒྲོལ་ཞེས་བགྱི་བ་དེ་གང་ཅུང་ཟད་ཅི་སློང་བ་དེ་ཐམས་ཅད་སྩོལ་གྱིས།
en: “ ‘My dear,’ she replied, ‘there is a king called Viśvāmitra in Viśvapurī. His son, called Viśvantara, gives everything that is begged for.

source: དེ་ལ་བདག་གི་བཀོལ་བ་སློངས་ཤིག །བཟང་མོ་གལ་ཏེ་དེ་ལྟ་ན་ལྷན་ཅིག་ཏུ་འདོང་ངོ་།
en: Beg him for a servant for me.’ “ ‘O good lady, if that is the case, let us go together.’

source: །དེ་ནས་ངན་ཏོ་རེ་ཐམས་ཅད་ཀྱི་གྲོང་རྡལ་དུ་ཕྱིན་ནས་དྲིས་པ། གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་གང་ན།
en: “Thereupon Jujjuka went to Viśvapurī and asked, ‘Where is Prince Viśvantara?’

source: དེ་དག་གིས་སྨྲས་པ། དཀའ་ཐུབ་ཀྱི་ནགས་ན་གནས་སོ།། །།འདུལ་བ་གཞི། བམ་པོ་བཞི་བཅུ་རྩ་བདུན་པ།
en: “ ‘He lives in the forest of ascetics,’ they answered.

source: དེ་ནས་ངན་ཏོ་རེ་ཆུང་མ་དང་ལྷན་ཅིག་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་སོང་བ་དང་། དེའི་ཚེ་རྒྱགས་སྦྱིན་མ་མེ་ཏོག་དང་འབྲས་བུའི་ཕྱིར་སོང་ངོ་།
en: “Then Jujjuka went to the forest of ascetics with his wife. At that time Mādrī went to collect flowers and fruits.

source: །དེ་ནས་བྲམ་ཟེ་ངན་ཏོ་རེ་རྒྱགས་སྦྱིན་མ་མེ་ཏོག་དང་། འབྲས་བུའི་ཕྱིར་སོང་བ་དང་། ཐམས་ཅད་སྒྲོལ་གྱི་དྲུང་དུ་འོངས་ནས་སྨྲས་པ།
en: Then the brahmin Jujjuka, after Mādrī had gone to collect flowers and fruits, approached Viśvantara and said: “ ‘Even if one were to search the entire earth with its cities and villages,

source: །རི་བོ་མཆོག་རྒྱས་ནུ་མར་ལྡན་པའི་རོ་སྟོད་ཅན། །གྲོང་ཁྱེར་གྲོང་རྡལ་བཅས་པའི་ས་ལ་བཅལ་བྱས་ཀྱང་།
en: Whose torso has great, excellent mountains as breasts.

source: །བདག་ཅག་བཀོལ་བ་མ་མཆིས་པས། །སྤ་ཤུག་ལྷན་ཅིག་འཁྱམ་བགྱིད་ན།
en: Because we do not have any servants.

source: །ཁྱོད་ཀྱིས་རྗེས་སུ་བརྩེ་བགྱིས་ཏེ།
en: It is therefore appropriate for you

source: །བདག་ལ་བཀོལ་བ་སྩལ་བའི་རིགས།
en: To have compassion for us and give us servants.’

source: །ཁོ་བོ་ལ་བཀོལ་བ་ག་ལ་ཡོད།
en: “ ‘Why would I have any servants?’ asked the prince.

source: དེ་དང་ཧ་ཅང་མི་རིང་བ་ཞིག་ན་ནག་པོ་དང་དྲ་བ་ཅན་རྩེ་ཞིང་འདུག་པ་དང་། དེས་སྨྲས་པ།
en: “Near them, Kṛṣṇa and Jālinī were playing.

source: བུས་པ་གཞོན་ནུ་འོ་ནི་དག་བྱིན་ཅིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བུ་སྡུག་པ་ཡོངས་སུ་གཏོང་བ་ལ་ཡུད་ཙམ་ཞིག་སེམས་པར་གྱུར་ཏོ།
en: Jujjuka said, ‘Give us these young children.’ “Having this asked of him, the bodhisattva pondered for a while about giving away his beloved children.

source: །དེ་ནས་བྲམ་ཟེ་དེས་ཐམས་ཅད་སྒྲོལ་ལ་སྨྲས་པ། ཀྱེ་རྒྱལ་རིགས་གཞོན་ནུ་ཁོ་བོས་ཁྱོད་ཐམས་ཅད་གཏོང་བའོ། །ཞེས་ཐོས་ནས་དེའི་ཕྱིར་ཁོ་བོ་ཁྱོད་ལ་སློང་ན།
en: Then the brahmin said to Viśvantara, ‘O kṣatriya prince, since I have heard that you give everything, I am begging you.

source: འདི་ལ་ཁྱོད་ཀྱིས་དཔྱད་དུ་ཅི་ཞིག་ཡོད།
en: What do you have to consider about this?

source: སྙིང་རྗེ་ཡི་ནི་བདག་ཉིད་ཁྱོད།
en: “ ‘Being naturally compassionate, you are renowned

source: །ཐམས་ཅད་གཏོང་བར་ས་སྟེངས་གྲགས།
en: Throughout the world as Sarvaṃdada, “Giver of Everything.” It is appropriate for you to act

source: །ཇི་ལྟར་གྲགས་པ་དེ་བཞིན་དུ། །ཁྱོད་ཀྱིས་ས་སྟེངས་བྱ་བའི་རིགས།
en: In the world in the way you are known for.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔས་བྲམ་ཟེ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Having been spoken to like this, the bodhisattva said to the brahmin: “ ‘I would not waver for one moment

source: །རང་གི་སྲོག་ནི་གཏོང་བ་ལའང་།
en: Even when giving away my own life;

source: །བདག་གིས་རེས་འགའང་མ་དཔྱད་ན།
en: Needless to say, I would not change my mind

source: །རང་གི་བུ་ནི་གཏོང་བ་ལ། །བདག་བློ་གཞན་འགྱུར་སྨོས་ཅི་དགོས།
en: About giving away my children.

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་ལྟ་མོད་ཀྱི། བདག་གིས་ནགས་སུ་བསྐྱེད་བསྐྱེད་པའི། །བུས་པ་འདི་གཉིས་ཡོངས་སྤངས་ན།
en: “ ‘Great brahmin, however, “ ‘I wonder, if I abandon these two children Who have grown up in the forest, How they will live

source: །བུས་པ་བཏང་ལ་བདག་མིན་ཞེས། །ཁ་ཅིག་བདག་ལ་འཕྱར་འོང་གིས།
en: That he gives away his children, but not himself.”

source: །དེ་ནས་བྲམ་ཟེ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་རྒྱལ་རིགས་གཞོན་ནུ་རྒྱལ་པོ་ཆེན་པོའི་རིགས་སུ་སྐྱེས་པ།
en: “Then the brahmin said to the bodhisattva, ‘O kṣatriya prince, it is not appropriate for you, who were born to a lineage of great kings;

source: སྲོག་ཆགས་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བས་འོ་བྱམས་པར་ཞུགས་པ།
en: who loves all beings with compassion;

source: སྦྱིན་པ་དང་། མཆོད་པ་དང་། བཀུར་སྟིས་སྤོས་ཀྱི་གླང་པོ་ལྟ་བུ།
en: who is just like a rutting elephant in your donations, veneration, and paying honor;

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། གློ་བུར་བ་དང་། སྐྱེ་བོ་བླ་མ་ལ་མཆོད་པ།
en: who venerates śramaṇas, brahmins, guests, and respectable people;

source: བཀྲེན་པ་དང་། མགོན་མེད་པ་དང་། ཕོངས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ།
en: who accepts those who are poor, helpless, and destitute;

source: ཁྱོད་ཀྱི་མེད་དོ་ཞེས་བྱ་བའི་ཚིག་གིས་ཁོ་བོ་ཡིད་ལ་རེ་བ་ཀུན་དུ་རྟོག་པའི་རྟ་བཏབ་ན་མྱུར་དུ་ལྡོག་པར་འགྱུར་རོ།
en: If my chariot of mind (manoratha, “wish”), whose horses are thoughts, is struck by your words of refusal, it will quickly return.

source: །དེ་བས་ན་ཁྱོད་ཀྱིས་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། གཏང་བའི་རིགས་སོ།
en: Therefore, it is appropriate for you to satisfy my wish and give them.’

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བྲམ་ཟེ་གལ་ཏེ་དེ་ལྟ་ན་ཡོངས་སུ་གཏང་ངོ་།
en: “ ‘O brahmin,’ said the bodhisattva, ‘if so, I will give them.’

source: །བུས་པ་གཞོན་ནུ་དག་གཏང་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ། རྒྱགས་སྦྱིན་མ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་བར་ཆད་བྱེད་པར་འགྱུར་དུ་འོང་ངོ་སྙམ་ནས། སེང་གེ་མོ་ཞིག་གི་གཟུགས་སུ་བསྒྱུར་ཏེ་ལམ་བཀག་ནས་འདུག་པ་དང་། དེ་ནས་རྒྱགས་སྦྱིན་མས་སྨྲས་པ།
en: “As soon as he gave the young children, the worlds of the great billionfold universe quaked in six ways. Thereupon Śakra, Lord of the Gods, thought, ‘Mādrī is coming to deter the bodhisattva from giving donations.’ He assumed the form of a lioness and stood blocking the way. Then Mādrī said:

source: །ཁྱོད་ནི་ཅི་སྟེ་ལམ་བཀག་འདུག་པར་བྱེད།
en: Why are you blocking the way?

source: །གལ་ཏེ་བདག་ནི་མི་འཕྱོ་བདེན་ཞེ་ན།
en: If it is true that I am unshaken,

source: །ལམ་ལས་བཟུར་ཏེ་མྱུར་དུ་འགྲོ་བར་གྱིས།
en: Get out of the way and go quickly!

source: །ཁྱོད་ཀྱང་རི་དགས་རྒྱལ་པོའི་ཆུང་མ་ལ།
en: “ ‘You are the wife of the king of beasts;

source: །རི་དགས་རྒྱལ་པོའི་ཆུང་མས་བདག་ལམ་ཕྱེ།
en: So, wife of the king of beasts, make way for me.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། རི་དགས་ཀྱི་རྒྱལ་མོ་དེ་ལམ་དེ་ནས་ལོགས་ཤིག་ཏུ་སོང་ངོ་།
en: “Having been told this, the queen of beasts left the road in a certain direction.

source: །དེ་ནས་རྒྱགས་སྦྱིན་མ་བསྟི་གནས་གང་ན་བ་དེར་སོང་བ་དང་། ནག་པོ་དང་། དྲ་བ་ཅན་གང་ན་ཡང་མ་མཐོང་ནས།
en: Thereupon Mādrī went to the hermitage. She did not see Kṛṣṇa and Jālinī anywhere.

source: བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། རྗེའི་སྲས་བུས་པ་གཞོན་ནུ་གཉིས་གང་ན་མཆིས།
en: She went to the bodhisattva and asked, ‘My dear, where are the young children?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: “The bodhisattva replied:

source: ཁོ་བོའི་དྲུང་དུ་བྲམ་ཟེ་ཞིག །རེ་བས་ཡང་དག་འོངས་གྱུར་ན།
en: “ ‘A brahmin with a wish Came to me,

source: །དེ་བརྒྱལ་ནས་ས་ལ་འགྱེལ་བ་དང་། དེ་ལ་ཆུ་མང་པོས་བཏབ་ནས་བརྟས་ཏེ་སྨྲས་པ། རྗེའི་སྲས་བུས་པ་གཞོན་ནུ་དཀའ་ཐུབ་ཀྱི་ནགས་ནས་བསྐྲུན་པ་བདེ་བའི་བདག་ཉིད་ཅན་དེ་དག་ཁྱོད་ཀྱིས་ཅིའི་སླད་དུ་ཡོངས་སུ་སྤང་།
en: “She fainted and fell to the ground. After he poured much water on her, she came to and said, ‘My dear, the young children grew up in the forest of ascetics and had a happy nature. Why did you abandon them?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རང་གི་ལུས་ལས་བླ་གོས་ཕུད་དེ་རྒྱགས་སྦྱིན་མ་ལ་སྨྲས་པ། ཅིང་དེ་གཉིས་ལ་བྱམས་པ་མེད་སྙམ་མམ།
en: “Then the bodhisattva stripped the upper garment off his body and said to Mādrī, ‘Why do you think that I have no love for the two of them?

source: ངའི་བ་སྤུའི་ཁུང་ཐམས་ཅད་ནས་གས་ཏེ་ཁྲག་བྱུང་བ་ལ་ལྟོས།
en: Look at all my pores, which are rent and shedding blood.’

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ། བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་ལ་དགའ་བས་གལ་ཏེ་འགའ་ཞིག་གིས་རྒྱགས་སྦྱིན་མ་བླངས་ཏེ་དེ་ལ་བྱིན་ན་གཡོག་བྱེད་པ་མེད་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས། བདག་ཉིད་བྲམ་ཟེའི་ཁྱེའུ་ཞིག་གི་ཆ་བྱད་དུ་སྤྲུལ་ནས་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་འདུག་སྟེ་སྨྲས་པ།
en: “Śakra, Lord of the Gods, thought, ‘Since the bodhisattvas of the fortunate eon are pleased with giving, if someone asks for Mādrī and the bodhisattva gives her to him, there will be no one to attend him.’ He assumed the form of a young brahmin, stood in front of the bodhisattva, and said, ‘Friend, give me an attendant.’

source: གྲོགས་པོ་གཡོག་བྱིན་ཅིག །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བདག་ལ་གཡོག་ག་ལ་ཡོད།
en: “ ‘Where would I have an attendant?’ asked the bodhisattva.

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: “ ‘Give me Mādrī,’ Śakra replied.

source: རྒྱགས་སྦྱིན་མ་བྱིན་ཅིག །བྱང་ཆུབ་སེམས་དཔས་རྒྱགས་སྦྱིན་མའི་གདོང་དུ་བརྟག་པར་བརྩམས་པ་དང་། རྒྱགས་སྦྱིན་མས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཤེས་ནས་སྨྲས་པ།
en: “The bodhisattva then observed Mādrī’s face.

source: རྗེའི་སྲས་གལ་ཏེ་ཁྱོད་ཀྱིས་བདག་བཏང་ན་སྩལ་དུ་གསོལ།
en: Mādrī knew the bodhisattva’s thoughts and said, ‘My dear, if you are going to give me away, please do so.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བྲམ་ཟེ་ཁྱོད་ལ་བྱིན་ནོ།
en: “The bodhisattva said, ‘Brahmin, I will give her to you.’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྲམ་ཟེའི་ཁྱེའུའི་ཆ་བྱད་མི་སྣང་བར་བྱས་ཏེ་རང་གི་ཆ་བྱད་དུ་འདུག་ནས་སྨྲས་པ། དྲང་སྲོང་བདག་གི་རྒྱགས་སྦྱིན་མ་འདི་ཁྱོད་ལ་བཅོལ་གྱིས།
en: “Then Śakra, Lord of the Gods, dissolved his form as a young brahmin, assumed his own form, and said, ‘O ṛṣi, I entrust you with this Mādrī.

source: ཁྱོད་ཀྱིས་སུ་ལ་ཡང་མ་སྦྱིན་ཅིག །རྒྱགས་སྦྱིན་མས་བརྒྱ་བྱིན་གྱི་རྐང་པ་གཉིས་ལ་མགོ་བོས་གཏུགས་ཏེ་སྨྲས་པ།
en: You should never give her to anyone.’

source: ཀཽ་ཤི་ཀ་ཅི་ནས་ཀྱང་བུས་པ་གཞོན་ནུ་དེ་གཉིས་བྲན་ཉིད་དུ་མི་འགྱུར་བ་དེ་ལྟར་མཛོད་ཅིག །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེ་བཞིན་དུ་བྱའོ་ཞེས་སྨྲས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: “Mādrī bowed low until her forehead touched Śakra’s feet and requested him, ‘O Kauśika, please ensure by any means that our two young children do not fall into servitude.’ “ ‘I will do so,’ Śakra, Lord of the Gods, assured her, and he then disappeared.

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བུས་པ་གཞོན་ནུ་ཁྱེར་བའི་བྲམ་ཟེ་ཇི་ལྟར་ཐམས་ཅད་ཀྱི་གྲོང་རྡལ་དུ་འཚོང་བར་བརྩམས་པ་དེ་ལྟར་རྨོངས་པར་བྱས་སོ།
en: Thereupon Śakra, Lord of the Gods, drove that brahmin who had taken away the young children insane so that he tried to sell them in Viśvapurī.

source: །དེ་གཉིས་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་རྣམས་ཀྱིས་མཐོང་ནས་དེ་རྣམས་རྒྱལ་པོའི་དྲུང་དུ་དོང་སྟེ་སྨྲས་པ། བུས་པ་ནག་པོ་དང་། དྲ་བ་ཅན་ནི་བྲམ་ཟེ་ཞིག་ཚོང་འདུས་ན་འཚོང་ཞིང་མཆིས་ལགས་སོ།
en: The king’s men saw the two of them and then went to the king and said, ‘The children Kṛṣṇa and Jālinī are being sold by a brahmin at the market.’

source: །དེས་བསྒོ་བ། ཤེས་ལྡན་དག་དེང་ལ་ཁྲིད་དེ་ཤོག་ཤིག །དེ་གཉིས་ཁྲིད་དེ་འོངས་པ་དང་། རྒྱལ་པོས་སྲང་ལ་བཅལ་ཏེ་མཉམ་དུ་གསེར་གྱིས་བླུས་སོ།
en: “He ordered them, ‘Sirs, go and bring them.’ The two were brought, and the king weighed them and redeemed them for their weight in gold.

source: །རྒྱལ་པོ་དེས་བློན་པོ་རྣམས་ལ་བསྒོ་བ། ཤེས་ལྡན་དག་གང་ཞིག་ཁྱེའུ་དང་བུ་མོ་ཡང་ཡོངས་སུ་གཏོང་བར་བྱེད་པ་དེ་ལ་གཞན་ཡོངས་སུ་གཏོང་བར་མི་བྱ་བ་ཅི་ཡོད།
en: The king said to his ministers, ‘Sirs, is there anything else he who has even given away his son and daughter could not give away?

source: གཞོན་ནུ་དེ་ཁུག་ཤིག་དང་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་གཞུག་གོ།
en: Summon the prince. I will enthrone him.’

source: །བློན་པོ་རྣམས་ཀྱིས་དེ་དཀའ་ཐུབ་ཀྱི་ནགས་ནས་བཀུག་སྟེ།
en: “The ministers summoned him from the forest of ascetics.

source: དེ་རྒྱལ་པོའི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་བཞག་ནས་དེས་གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་མཆོད་སྦྱིན་གྱི་གནས་ཀྱི་ཁང་པ་བརྩིགས་ནས་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་སྦྱིན་པ་དག་བྱིན།
en: After he was enthroned, he built offering halls at the four city gates, gave donations, and made merit for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: བསོད་ནམས་དག་བྱས་ཏེ་དེ་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་གྱི་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Having seen the perfection of his offerings, he spoke these verses:

source: བྱང་ཆུབ་བསོད་ནམས་དོན་གཉེར་བས། །དགེ་སྦྱོང་རྣམས་དང་བྲམ་ཟེ་དང་། །དམངས་རིགས་གདོལ་པ་གཡུང་པོ་ལ།
en: “ ‘One who seeks awakening and merit

source: །འཇིགས་པ་མེད་པར་སྦྱིན་པ་བྱིན།
en: Gives donations without fear To śramaṇas, brahmins,

source: །གསེར་དང་དངུལ་དང་བ་ལང་དང་། །རྟ་དང་ནོར་བུ་རྒྱན་རྣམས་དང་། །དེ་བཞིན་ལས་དག་བྱེད་པའི་བྲན།
en: Śūdras, caṇḍālas, and pukkasas. “ ‘He gives gold, silver, oxen, Horses, various jeweled ornaments, And slaves to do various tasks

source: །ཚུལ་ཁྲིམས་ལྡན་པ་རྣམས་ལ་སྦྱིན།
en: To those who have good conduct. “ ‘By giving his son and daughter

source: །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཏུ། །མི་ཡིས་དག་པ་འཐོབ་པར་འགྱུར།
en: One will attain purity In this world and the next.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བར་གྱུར་པ་གང་གིས་བུ་དང་ཆུང་མ་ཡོངས་སུ་བཏང་བ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was the king named Viśvantara, who gave away his children and wife, at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བ་དེར་གྱུར་ཏེ། ངས་དེ་ན་བུ་དང་ཆུང་མ་ཡོངས་སུ་བཏང་ངོ་།
en: I was that king named Viśvantara at that time, on that occasion, and I gave away my children and wife.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་བུ་དང་ཆུང་མ་ཡོངས་སུ་བཏང་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by my giving away my children and wife, you should think otherwise;

source: འོན་ཀྱང་སྦྱིན་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: this donation was only a cause, only a condition, only a preparation for supreme and complete awakening.” 11. Saṃdhāna

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བྱིན།
en: “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story.

source: བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱི་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བ་རྒྱལ་སྲིད་བྱེད་དེ། འབྱོར་པ་དང་། རྒྱས་པ་དང་ཞེས་བྱ་བ་ནས་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “ Great King, once in a city called Vārāṇasī a king named Brahmadatta was ruling over the country, which was rich, prosperous, . . . in accordance with the Dharma.

source: །ཇི་ཙམ་ན་ལྟས་མཁན་དག་གིས་བཱ་རཱ་ཎ་སཱིར་ལོ་བཅུ་གཉིས་སུ་ཆར་པ་མི་འབབ་བོ་ཞེས་ལུང་བསྟན་ཏོ།
en: “One day astrologers predicted that it would not rain for twelve years in Vārāṇasī.

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གྱིས་རང་གི་ཡུལ་དུ་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: King Brahmadatta then announced with the ringing of bells in his country:

source: ངའི་ཡུལ་ན་གནས་པའི་ཤེས་ལྡན་གྲོང་ཁྱེར་པ་དག་ཉོན་ཅིག །ལྟས་མཁན་དག་གིས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབབ་པར་ལུང་བསྟན་གྱིས།
en: ‘Listen, people living in my country! Astrologers have predicted that it will not rain for twelve years.

source: ཁྱོད་ཅག་ལས་གང་དག་ལ་ལོ་བཅུ་གཉིས་སུ་བཟའ་བ་དང་བཏུང་བ་ཡོད་པ་དེ་རྣམས་ནི་འདུག་ཤིག །གཞན་རྣམས་ནི་བཟའ་བ་དང་བཏུང་བ་མོད་པའི་ཡུལ་དུ་དེངས་ཤིག །ལོ་ལེགས་པར་གྱུར་པ་དང་སླར་ཡང་ཤོག་ཤིག །
en: Whoever among you has food and drink to last twelve years should stay. Others should go to countries where there is food and drink, and come back when there is again an abundant harvest.’

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་ཁྱིམ་བདག་འདུམ་བྱེད་ཅེས་བྱ་བ་ཕྱུག་པ་ནོར་མང་བ། ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་གཟུང་བ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ།
en: “At that time, there was a householder named Saṃdhāna living in the city of Vārāṇasī, who was very rich and had great wealth and many possessions, with holdings both vast and extensive.

source: །དེས་མངན་བཀུག་སྟེ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་བང་བ་ན་བདག་འཁོར་གྱི་སྐྱེ་བོ་དང་བཅས་པ་ལོ་བཅུ་གཉིས་ཀྱི་རྒྱགས་ཐུབ་པ་ཡོད་དམ།
en: He called the storehouse keeper and asked, ‘My good man, is there enough food for me and my attendants to survive for twelve years?’

source: འོན་ཏེ་མེད་དེས་སྨྲས་པ། ཇོ་བོ་མཆིས་སོ།
en: “ ‘Yes, there is, Master,’ answered the storehouse keeper.

source: །དེ་ནས་ཁྱིམ་བདག་འདུམ་བྱེད་འཁོར་དང་བཅས་པ་ནི་འདུག་གོ།
en: “Thus, the householder Saṃdhāna stayed with his attendants.

source: །སྐྱེ་བོའི་ཚོགས་གཞན་ནི་བཟའ་བ་དང་བཏུང་བ་མོད་པའི་ཡུལ་དུ་དོང་ངོ་།
en: Other people went to countries where there was food and drink.

source: །སངས་རྒྱས་འབྱུང་བ་མེད་པ་ན་འཇིག་རྟེན་དུ་རང་སངས་རྒྱས་དམན་པ་དང་ངན་པ་ལ་སྙིང་བརྩེ་བ་ཅན། བས་མཐའི་གནས་མལ་ལ་དགའ་བ།
en: “When the buddhas do not appear, there appear self-awakened ones as the only fields of merit in the world, who are compassionate toward inferior, wretched people and content with places to sit on the outskirts of towns.

source: འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་དག་འབྱུང་བར་འགྱུར་བས་ཇི་ཙམ་ན་བཱ་རཱ་ཎ་སཱིའི་ཕྱོགས་གཅིག་ཏུ་རང་སངས་རྒྱས་ལྔ་བརྒྱ་གནས་སོ།
en: At that time there lived five hundred self-awakened ones in one place in Vārāṇasī.

source: །ཕྱོགས་གཞན་ཞིག་ཏུ་ཡང་རང་སངས་རྒྱས་ལྔ་བརྒྱའོ།
en: In another place, there were five hundred self-awakened ones, too.

source: །དེ་ནས་རང་སངས་རྒྱས་ལྔ་བརྒྱ་པོ་དག་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ། ཁྱིམ་བདག་འདུམ་བྱེད་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། ཁྱིམ་བདག་འདུམ་བྱེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then early one morning, the first five hundred self-awakened ones dressed, took their bowls and their robes, and went to the householder Saṃdhāna.

source: །ཁྱིམ་བདག་ཁྱོད་ཀྱིས་རབ་ཏུ་བྱུང་བ་ལྔ་བརྒྱ་ལ་ལོ་བཅུ་གཉིས་སུ་བསོད་སྙོམས་འབུལ་ནུས་སམ། དེས་སྨྲས་པ།
en: When they arrived, they asked the householder Saṃdhāna, ‘Householder, can you give almsfood to five hundred mendicants for twelve years?’

source: འཕགས་པ་དག་རེ་ཞིག་མངན་ལ་རྨས་ཏེ་བགྱིའོ།
en: “ ‘Noble ones,’ he replied, ‘I will now ask the storehouse keeper.’

source: །དེས་མངན་བཀུག་སྟེ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་བདག་འཁོར་དང་བཅས་པ་དང་། རབ་ཏུ་བྱུང་བ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཀྱི་ལོ་བཅུ་གཉིས་ཀྱི་རྒྱགས་ཐུབ་པ་ཡོད་དམ།
en: “He called the storehouse keeper and asked him, ‘My good man, is there enough food for me, my attendants, and these five hundred mendicants to survive for twelve years?’

source: དེས་སྨྲས་པ། ཇོ་བོ་མཆིས་སོ།
en: “ ‘Yes, there is, Master,’ answered the storehouse keeper.

source: །དེ་ནས་རང་སངས་རྒྱས་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ལ་ཁས་བླངས་སོ།
en: “He then made a promise to feed the five hundred self-awakened ones.

source: །ཇི་ཙམ་ན་ཕྱི་དྲོའི་དུས་སུ་རང་སངས་རྒྱས་ལྔ་བརྒྱ་པོ་གཞན་ཡང་ལྷགས་ནས་ཁྱིམ་བདག་འདུམ་བྱེད་ལ་ཁྱིམ་བདག་རང་སངས་རྒྱས་ལྔ་བརྒྱ་པོ་འདི་དག་ལ་ཁྱོད་ཀྱིས་ལོ་བཅུ་གཉིས་སུ་བསོད་སྙོམས་དབུལ་བར་ནུས་སམ་ཞེས་བསླངས་པ་དང་། དེས་སྨྲས་པ།
en: “Later, in the afternoon, the other five hundred self-awakened ones came and asked the householder Saṃdhāna, ‘Householder, can you give almsfood to five hundred mendicants for twelve years?’

source: འཕགས་པ་དག་ཁྱེད་ཅག་ལ་གཡར་གྱིས་བླངས་ལགས་ན་ཡང་བསླང་ཅི་འཚལ།
en: “ ‘Noble ones,’ he replied, ‘I have already promised it to you. Are you asking for it again?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ཁྱིམ་བདག་དེ་དག་ཀྱང་གཞན་ལ། བདག་ཅག་ཀྱང་གཞན་ཡིན་ནོ། །དེས་སྨྲས་པ།
en: “ ‘Householder, they are one group, and we are another,’ they answered.

source: འཕགས་པ་དག་གལ་ཏེ་དེ་ལྟ་ན་རེ་ཞིག་མངན་ལ་རྨས་ཏེ་བགྱིའོ།
en: “ ‘Noble ones, if that is so,’ he said, ‘I will now ask the storehouse keeper.’

source: །དེས་མངན་བཀུག་སྟེ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་བདག་འཁོར་དང་བཅས་པ་དང་། རབ་ཏུ་བྱུང་བ་སྟོང་གི་ལོ་བཅུ་གཉིས་ཀྱི་རྒྱགས་ཐུབ་པ་ཡོད་དམ།
en: “He called the storehouse keeper and asked him, ‘My good man, is there enough food for me, my attendants, and a thousand mendicants to survive for twelve years?’

source: །དེ་ནས་ཁྱིམ་བདག་དེས་རང་སངས་རྒྱས་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ལ་ཁས་བླངས་ནས་ཞུས་པ། ཁྱེད་ཅག་གི་དུས་གང་ལགས།
en: “The householder Saṃdhāna then made a promise to those five hundred self-awakened ones and asked, ‘When is your mealtime?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། གུང་ཚིགས་མ་ཡོལ་བའོ།
en: “ ‘It is before noon.’ they replied.

source: །དེ་ནས་ཁྱིམ་བདག་འདུམ་བྱེད་ཀྱིས་སྦྱིན་པའི་ཁང་པ་བརྩིགས་ནས་སྦྱིན་པའི་ཞལ་ཏ་པའི་མི་དག་ཀྱང་བསྐོས། དུས་ཚོད་བརྗོད་པ་དག་ཀྱང་བསྐོས་ཏེ། དེས་ཉི་མ་རེ་རེ་ཞིང་རང་སངས་རྒྱས་སྟོང་ལ་བསོད་སྙོམས་འབུལ་དུ་བཅུག་གོ།
en: “Thereupon the householder Saṃdhāna had an offering hall built and appointed managers of the offerings and also persons to announce the mealtimes. He had almsfood offered to the thousand self-awakened ones every day.

source: །མུ་གེ་དེ་ཡང་ལོ་བསྟུད་མ་ཁོ་ནར་བར་ཡེ་མ་ཆད་ནས།
en: “The famine continued and never ceased.

source: དེ་ནས་ཁྱིམ་བདག་དེས་རང་སངས་རྒྱས་རྣམས་ལ་ཞུས་པ། འཕགས་པ་དག་ལྷས་ཆར་འབེབས་པར་འགྱུར་རམ།
en: At a certain point, the householder asked the self-awakened ones, ‘Noble ones, will it rain?’

source: ཆར་འབེབས་པར་འགྱུར་རོ།
en: “ ‘It will rain.’

source: །བདག་གིས་ས་བོན་སྩལ་ཏམ།
en: “ ‘Should I sow seeds?’

source: ཐོབ་ཤིག །དེ་དག་གིས་ས་བོན་བཏབ་བོ།
en: “ ‘Yes, sow them.’ “And so they did sow seeds.

source: །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ཤེས་པ་མཐོང་བ་ནི་འོག་ཏུ་འཇུག་པ་ཡིན་པས་དེས་བསམས་པ་འཇིག་རྟེན་ན་ཡོན་གནས་གང་ཇི་སྙེད་པ་དེ་རྣམས་ཀྱི་མཆོག་ནི་རང་སངས་རྒྱས་རྣམས་ཡིན་ལ། སྦྱིན་བདག་གང་ཇི་སྙེད་པ་དེ་རྣམས་ཀྱི་མཆོག་ནི་ཁྱིམ་བདག་འདུམ་བྱེད་ཡིན་གྱིས།
en: The knowledge of Śakra, Lord of the Gods, works downward, so he thought, ‘In the world, the best of all those worthy of veneration are self-awakened ones, and the best of all donors is the householder Saṃdhāna.

source: བདག་གིས་འདི་དག་གི་གྲོགས་བྱའོ་སྙམ་ནས།
en: So I will help them.’

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དབང་པོ་ཆེན་པོའི་ཆར་ཕབ་པ་དང་། ལོ་ཏོག་དེ་རྣམས་ཀུ་བར་སྐྱེས་སོ།
en: “Then Śakra, Lord of the Gods, caused a greatly powerful rain, and the seeds sprang up as gourds.
